matrix = [
    [1, 4, 7, 14, 15],
    [2, 5, 8, 12, 19],
    [3, 6, 9, 16, 22],
    [10, 13, 14, 17, 24],
    [18, 21, 23, 26, 30]
]

def Finder(num):
    i = 0  # Начальная позиция по вертикали (верхняя граница)
    j = len(matrix[0]) - 1  # Начальная позиция по горизонтали (правая граница)

    while i < len(matrix) and j >= 0:
        # Пока не достигнута нижняя граница и левая граница
        if matrix[i][j] == num:
            return [i, j]  # Элемент найден
        elif matrix[i][j] > num:
            j -= 1  # Двигаемся влево
        else:
            i += 1  # Двигаемся вниз

    return 'не найден'  

print(Finder(26))
